using Books_shop.Data.Models;
using Microsoft.AspNetCore.Builder;
using Microsoft.Extensions.DependencyInjection;
using System.Collections.Generic;
using System.Globalization;
using System.Linq;

namespace Books_shop.Data
{
    public class DBObjects
    {
        public static void Initial(AppDBContent content) 
        {

            if (!content.Category.Any())
                content.Category.AddRange(Categories.Select(c => c.Value));

            if (!content.Book.Any())
            {
                content.AddRange(
                   new Book
                   {
                       name = "Есенціалізм",
                       author = "Грег МакКеон",
                       shortDesc = "Миcтeцтвo визнaчaти пpiopитeти",
                       longDesc = "Чи відчували ви коли-небудь, що викладаєтеся на повну, але не отримуєте бажаного результату? Перепрацьовуєте й водночас не займаєтеся тим, чим потрібно?.. Ґреґ Маккеон пропонує власну концепцію Есенціалізму, завдяки якій ви навчитеся помічати найсуттєвіше, відкидати непотрібне й устигати найважливіше.",
                       img = "/img/есенціалізм.jpg",
                       price = 350,
                       isFavourite = false,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "Гаррі Поттер і прокляте дитя",
                       author = "Джоан Роулінг, Джек Торн, Джон Тіффані",
                       shortDesc = "Остання книга серії книг про Гаррі Поттера",
                       longDesc = "30 вересня 2016 року у Києві в Українському домі пройшла презентація книги «Гаррі Поттер і Прокляте дитя» українською мовою. Згідно домовленості, адаптація п’єси британської письменниці Джоан Роулінг для різних країн почалася тільки після того, як твір офіційно презентували в Англії. Наприкінці липня в Лондоні відбулася прем’єра п’єси за мотивами нової історії.",
                       img = "/img/гаррі-поттер-і-прокляте-дитя.jpg",
                       price = 320,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Художня література"]
                   },

                   new Book
                   {
                       name = "Жінка, яка має план. Життя, сповнене пригод, краси й успіху",
                       author = "Мей Маск",
                       shortDesc = "Історії й уроки «сміливого, але обережного життя» моделі світового рівня, матері Ілона Маска",
                       longDesc = "Я давно захоплююся Мей Маск і як моделлю, і як жінкою. Упродовж своєї кар’єри вона надихала безліч людей, а тепер її неймовірна мудрість і відвертість промовляють до нас зі сторінок цієї книжки - Карлі Клосс, американська модель",
                       img = "/img/жінка-яка-має-план.jpg",
                       price = 400,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Біографії та мемуари"]
                   },

                   new Book
                   {
                       name = "Місто дівчат",
                       author = "Елізабет Ґілберт",
                       shortDesc = "«Місто дівчат» — новий бестселер Елізабет Ґілберт, яка підкорила світ романами «Їсти, молитися, кохати» та «Природа всіх речей».",
                       longDesc = "Роман «Місто дівчат» починається 1940 року, коли дев’ятнадцятилітню Вівіан Морріс виганяють з престижного коледжу. Батьки відправляють доньку на Мангеттен до тітки — власниці невеликого, проте дуже ексцентричного театру. Несподівано для себе Вівіан опиняється у справжньому вирі довоєнного богемного життя. Знайомства із зірками, незвичайні театральні постановки, нестримний секс, ріки алкоголю і відчуття цілковитої свободи спершу заворожують та спокушають, а потім вибивають землю з-під ніг. І це лише початок шляху Вівіан довжиною в життя, який необхідно пройти, щоб зрозуміти: ти не мусиш бути хорошою дівчинкою, щоб бути хорошою людиною.",
                       img = "/img/місто-дівчат.jpg",
                       price = 350,
                       isFavourite = false,
                       available = true,
                       Category = Categories["Художня література"]
                   },

                   new Book
                   {
                       name = "Мавка. Лісова пісня",
                       author = "Леся Українка",
                       shortDesc = "Оновлена книга драми-феєрії відомої української письменниці й поетеси Лесі Українки.",
                       longDesc = "Минають роки, минають десятиліття, але ми знову й знову повертаємось до деяких літературних творів... Сьогодні, коли поширюється інтерес до нашої історії та культури, пропонуємо вам перечитати драму-феєрію відомої української письменниці й поетеси Лесі Українки. Цей твір розповідає про зв’язок людини і природи, про безсмертя вічних людських цінностей, добро і зло; про пошук гармонії, кохання і зраду; про матеріальне і духовне в житті. Це гімн справжньому коханню. Завдяки прекрасним ілюстраціям дивовижного краю з майбутнього анімаційного фільму «Мавка. Лісова пісня» пориньте у цей фантастичний світ і насолоджуйтеся колоритною мелодійною українською мовою. Сьогодні за допомогою сучасних технологій ми маємо можливість ще більше заглибитися у драму-феєрію. За допомогою QR-коду можна прослухати дивні народні волинські мелодії, що їх так цінувала поетеса.",
                       img = "/img/мавка.jpg",
                       price = 650,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Художня література"]
                   },

                   new Book
                   {
                       name = "Фактор Черчилля. Як одна людина змінила історію",
                       author = "Боріс Джонсон",
                       shortDesc = "Життя цього чоловіка є доказом того, що одна людина — відважна, геніальна, визначна — може впливати на світовий лад",
                       longDesc = "Книжка Боріса Джонсона — це історія про те, як ексцентричний геній Черчилля, прем’єр-міністра Великої Британії, одного з найвизначніших лідерів ХХ століття, формував світову політику. Аналізуючи досягнення й помилки, а також міфи, які супроводжували цю видатну постать, Джонсон зобразив Черчилля як незрівнянного стратега, людину надзвичайно сміливу, красномовну й глибоко гуманну. Безстрашний на полі бою, один із найкращих ораторів усіх часів, лауреат Нобелівської премії з літератури, Вінстон Черчилль спростував думку, що історія — це місце дії великих знеособлених сил.",
                       img = "/img/черчиль.jpg",
                       price = 340,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Біографії та мемуари"]
                   },

                   new Book
                   {
                       name = "Короткий курс історії України",
                       author = "Олександр Палій",
                       shortDesc = "Пропонуємо вашій увазі книгу Олександра Палія «Короткий курс історії України» українською мовою від видавництва «А-ба-ба-га-ла-ма-га»!",
                       longDesc = "Історія грає серйозну роль у сучасності. Вона підносить нам цінні уроки та допомагає зрозуміти причини явищ нашого часу.Щоб дати зрозуміти яким було життя українського народу з давніх часів, була написана книга «Короткий курс історії України». Це своєрідний підручник з історії України, що розповість про її перемоги та поразки, ворогів та героїв, стійкість духу її народу та спроби його підкорити.",
                       img = "/img/історія-україни.jpg",
                       price = 170,
                       isFavourite = false,
                       available = false,
                       Category = Categories["Історична література"]
                   },

                   new Book
                   {
                       name = "Підсвідомості все підвладне",
                       author = "Джон Кехо",
                       shortDesc = "Джон Кехо - тренер з особистісного зростання зі світовим ім'ям, автор бестселерів, розробник семінарів та тренінгів, які допомогли тисячам змінити своє життя.",
                       longDesc = "Підсвідомість - своєрідна Маріанська западина; це нетрі людської психіки. Підсвідомість керує нашими вчинками, коли ми цього навіть не усвідомлюємо. Недарма Зиґмунд Фройд казав: \"Ми не випадково обираємо одне одного. Ми зустрічаємо тільки тих, хто вже існує в нашій підсвідомості\". Так і в нашій підсвідомості заховано ключ від щасливого життя. Керуючись набором принципів, які розробив Джон Кехо, ви відчините всі двері та відімкнете брами на шляху до успіху.",
                       img = "/img/підсвідомості-все-підладне.jpg",
                       price = 300,
                       isFavourite = false,
                       available = false,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "Мистецтво говорити",
                       author = "Джеймс Борг",
                       shortDesc = "Таємниці ефективного спілкування",
                       longDesc = "Бізнес-тренер Джеймс Борґ, відомий своїми відкриттями в галузях спілкування, особистісного розвитку, мови тіла та «контролю мислення», пропонує прості і дієві поради для кожної людини. Його методика допоможе змінити спосіб мислення і поведінку в особистому житті й на роботі, зробить життя цікавішим, насиченішим і позбавить зайвого стресу, а ваші навички спілкування сягнуть геть нового рівня.",
                       img = "/img/мистецтво-говорити.jpg",
                       price = 320,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "Шлях до фінансової свободи",
                       author = "Бодо Шефер",
                       shortDesc = "Багатство не падає з неба — звісно, якщо не сподіваєшся попасти під дощ із виграшних лотерейних білетів.",
                       longDesc = "Багатство не падає з неба — звісно, якщо не сподіваєшся попасти під дощ із виграшних лотерейних білетів. Однак завдяки правильній життєвій та фінансовій позиції та довгостроковому плану всі можуть досягнути фінансової безпеки та набути солідного статку, відчутно підвищивши рівень свого життя. Як звільнитися від стереотипів про гроші та заможність? Як уникнути боргів? Як правильно заощаджувати, не забувши про маленькі життєві радості, і як значно підвищити свій дохід? Бодо Шефер ділиться інсайдерською інформацією та розповідає про ефективні методи поводження з грошима, крок за кроком супроводжуючи читача на шляху до його фінансової свободи. Мрієте стати мільйонером за 7 років? Схоже, це цілком реально, варто лише почати вчитися фінансової грамотності, яка хоч і непроста, але цікава наука.",
                       img = "/img/шлях-до-фінансової-свободи.jpg",
                       price = 350,
                       isFavourite = false,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "Гаррі Поттер і філософський камінь",
                       author = "Джоан Роулінг",
                       shortDesc = "Перша частина пригод Гаррі Поттера — книга №1 для маленьких читачів. Саме вона сколихнула хвилю любові до читання, яка захопила цілий світ!",
                       longDesc = "Сирота на ім'я Гаррі живе під сходами у будинку дядька ті тітоньски Дурслі. Він поки що не знає, як потрапити на платформу дев'ять і три чверті, користуватися чарівною паличкою, та літати на мітлі. Але одного разу до нього прилетить сова із загаднковим листом, який запрошує його до навчання у Школі Чарів та Чаклунства, і з того дня його життя докорінно зміниться...",
                       img = "/img/гаррі-поттер-і-філософський-камінь.jpg",
                       price = 350,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Художня література"]
                   },

                   new Book
                   {
                       name = "Думай і багатій",
                       author = "Наполеон Гілл",
                       shortDesc = "«Думай і багатій» — книжка, вже довгі роки не здає позицій серед кращих бестселерів у літературі про бізнес та мотивацію.",
                       longDesc = "Коли Наполеон Гілл був ще зовсім юним, Дейл Карнегі розважливо поділився з ним таємною формулу успіху, яку він вивів ґрунтуючись на досягненнях видатних людей. Відтоді Наполеон Гілл не тільки зумів багато чого досягти в бізнесі та особистому житті, а й дав можливість всьому світу випробувати цю формулу на особистому досвіді.",
                       img = "/img/думай-і-багатій.jpg",
                       price = 230,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "Тигролови",
                       author = "Іван Багряний",
                       shortDesc = "Українська література: книжки зі шкільної програми в новому оформлені",
                       longDesc = "Іван Багряний (1906—1963; справжнє прізвище — Лозов’ягін) — український письменник, який зазнав жорстокості сталінських репресій. Митця було ув’язнено, заслано до Далекого Сходу, потім була еміграція. Лише після своєї смерті він був реабілітований, став лауреатом Шевченківської премії 1992 року, і його книги почали перевидавати в Україні.",
                       img = "/img/тигролови.jpg",
                       price = 175,
                       isFavourite = false,
                       available = true,
                       Category = Categories["Підручники та навчальні матеріали"]
                   },

                   new Book
                   {
                       name = "Пес Патрон. Маленька історія про велику мрію",
                       author = "Зоряна Живка",
                       shortDesc = "Ця книжка – своєрідна автобіографія Патрона. Зоряна Живка і Богдана Бондар підготували для українських дітей переклад із собачої мови на людську – і з цього вийшла ось така історія.",
                       longDesc = "Пес Патрон – улюбленець дітей та дорослих, талісман Державної служби України з надзвичайних ситуацій, єдиний у світі пес доброї волі дитячого фонду ООН ЮНІСЕФ, володар медалі «За віддану службу», який допомагає саперам знешкоджувати ворожі вибухові пристрої.",
                       img = "/img/пес-патрон.jpg",
                       price = 238,
                       isFavourite = false,
                       available = false,
                       Category = Categories["Дитяча література"]
                   },

                   new Book
                   {
                       name = "Їсти, молитися, кохати",
                       author = "Елізабет Ґілберт",
                       shortDesc = "«Їсти, молитися, кохати» - надзвичайно щира розповідь жінки про духовне переродження і позитивні зміни у житті.",
                       longDesc = "Автор книги на власному прикладі довела, що навіть після найбільших криз можна не лише відновитися, а й відкрити в собі нові грані, можливості та рівні переживань. Героїня її роману - письменниця Ліз – розчарована у сімейному житті та зневірена в особистому щасті. Жінка втрачає головне: сенс та смак до життя. Аби набратися сил та повернутися до життя, Ліз вирішує подорожувати. На її шляху три країни: Італія, Індонезія та Індія. Там вона вчиться їсти зі смаком, молитися з відкритим серцем та кохати, наче вперше.",
                       img = "/img/їсти-молитися-кохати.jpg",
                       price = 280,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "7 звичок надзвичайно ефективних людей",
                       author = "Стівен Кові",
                       shortDesc = "Ця книжка — світовий супербестселер, праця №1 у темі росту особистості!",
                       longDesc = "Це книжка для тих, хто хоче стати кращим у професійній діяльності, максимально реалізувати свій творчий потенціал та назавжди змінити своє життя на краще.",
                       img = "/img/7-звичок-надзвичайно-ефективних-людей.jpg",
                       price = 265,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                   new Book
                   {
                       name = "Емоційний інтелект",
                       author = "Стівен Кові",
                       shortDesc = "Книжка Девіда Ґоулмана - один із безперечних психологічних бестселерів останніх десятиліть.",
                       longDesc = "Залежність між інтелектом і життєвим успіхом зрозуміла і майже аксіоматична. А як впливає на життєві здобутки емоційна сфера людини? Які емоційні складники передусім формують нашу долю? Чи можна (і як саме, якщо так) виправити емоційні моделі, закладені в людині, коли вони гальмують її рух до кращого? І взагалі, чи реально об'єднати два слова - \"емоційний\" та \"інтелект\" - і не дістати суперечність? ВІдповіді на ці питання дає оперта на наукову базу й водночас легко написана для широкої аудиторії книжка Девіда Ґоулмана - один із безперечних психологічних бестселерів останніх десятиліть.",
                       img = "/img/емоційний-інтелект.jpg",
                       price = 270,
                       isFavourite = true,
                       available = true,
                       Category = Categories["Саморозвиток та психологія"]
                   },

                    new Book
                    {
                        name = "Тріумфальна арка",
                        author = "Еріх Марія Ремарк",
                        shortDesc = "Роман, що увійшов до списку 100 найкращих світових бестселерів",
                        longDesc = "Франція, 1939 рік. Світ на порозі Другої світової війни. Людвіг — один з тих, хто вже відчув жорстокість нацистів: він пройшов тортури гестапівців, концтабір, утратив кохану. Рятуючись, чоловік тікає до Франції та змінює ім’я. Відтепер він хірург-біженець Равік. Митарства та злидні емігрантської долі лягають на плечі чоловіка. Одного разу він зустрічає Джоан Маду, актрису з Італії. Вона так само, як і Равік, самотня й загублена в цьому холодному світі. Лиха година поєднує їхні душі, а кохання, яке спалахує між ними, стає гірким від сліз…",
                        img = "/img/тріумфальна-арка.jpg",
                        price = 210,
                        isFavourite = true,
                        available = true,
                        Category = Categories["Художня література"]
                    },

                    new Book
                    {
                        name = "Чоловік на ім'я Уве",
                        author = "Фредрік Бакман",
                        shortDesc = "Роман «Чоловік на ім'я Уве» - літературний дебют популярного шведського журналіста, блогера Фредріка Бакмана.",
                        longDesc = "На сьогодні продано більше п'яти мільйонів примірників. Роман «Чоловік на ім'я Уве» - смішна, іронічна, зворушлива та мудра історія про людей, які через ті чи інші причини стали непотрібні суспільству. Твір про щоденну мужність жити і бути собою.\r\n\r\nУве - добрий буркотун, якого неодноразово випробовувала доля. Вийшовши на пенсію, втративши кохану дружину, він змушений наново відшукувати сенс буття. Та чи хоче цього Уве? Яким би сумним не був його вибір, на чоловіка чекає ще багато любові, дружби і пригод.",
                        img = "/img/чоловік-на-ім'я-Уве.jpg",
                        price = 330,
                        isFavourite = true,
                        available = true,
                        Category = Categories["Художня література"]
                    },

                    new Book
                    {
                        name = "Психологiя впливу",
                        author = "Роберт Чалдіні",
                        shortDesc = "Ця книга, яка вже давно стала підручником для менеджерів, підприємців і взагалі всіх, хто бажає опанувати мистецтво впливу, навчить вас розуміти поведінку інших, уникати маніпуляторів людською свідомістю та спілкуватися, завжди досягаючи поставлених задач.",
                        longDesc = "Що може змусити кожну людину сказати «так»? Як переконувати людей та уникати небажаного впливу? Відповіді шукайте на сторінках цієї книги, яка миттєво стала світовим бестселером. Її автор описує методи й закони психологічного тиску й створення конкуренції. Використовуючи яскраві приклади з життя, Роберт Чалдині дає унікальні поради, як викорінити в собі синдром жертви й не потрапити на гачок нав’язливої реклами, а також навчитися самому переконувати й здобувати бажане.",
                        img = "/img/психологiя-впливу.jpg",
                        price = 350,
                        isFavourite = true,
                        available = false,
                        Category = Categories["Саморозвиток і психологія"]
                    }
                );
            }
            content.SaveChanges();
        }

        private static Dictionary<string, Category> category;
        public static Dictionary<string, Category> Categories
        {
            get
            {
                if (category == null)
                {
                    var list = new Category[]
                    {
                    new Category {categoryName = "Художня література", description = "Романи, повісті, оповідання, вірші, драми та інші літературні твори."},
                    new Category {categoryName = "Наукова література", description = "Книги з наукових дисциплін, таких як фізика, хімія, біологія, математика, інженерія, медицина та інші."},
                    new Category {categoryName = "Історична література", description = "Книги про історію різних країн, цивілізацій, культур, подій та особистостей."},
                    new Category {categoryName = "Біографії та мемуари", description = "Книги про життєві історії видатних людей, або про досвід, переживання та спогади автора."},
                    new Category {categoryName = "Релігійна література", description = "Книги, які описують релігійні погляди, традиції, історію та релігійні тексти."},
                    new Category {categoryName = "Хобі та розваги", description = "Книги про спорт, ремесла, мистецтво, музику, кулінарію та інші."},
                    new Category {categoryName = "Ділова література", description = "Книги про бізнес, менеджмент, маркетинг, фінанси, лідерство та інші аспекти професійного розвитку."},
                    new Category {categoryName = "Підручники та навчальні матеріали", description = "Книги з різних навчальних дисциплін, включаючи мови, історію, науку, технології, техніку та інші."},
                    new Category {categoryName = "Дитяча література", description = "Книги для дітей, включаючи казки, історії, наукові книги, енциклопедії та інші."},
                    new Category {categoryName = "Саморозвиток та психологія", description = "Книги, присвячені саморозвитку, психології та психотерапії."},

                    };

                    category = new Dictionary<string, Category>();
                    foreach (Category el in list)
                        category.Add(el.categoryName, el);
                }
                return category;
            }
        }

    }
}
